---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemTypeParam
source: html/1820c602-94c3-5aa3-4e91-2df2a4b3dc63.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemTypeParam Property

"Type"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemTypeParam { get; }
```